# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azure_service_operator.azurerm_role_assignment.aso_aks_vnet_role_assignment will be created
  + resource "azurerm_role_assignment" "aso_aks_vnet_role_assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69ebf7b5-63f8-4be4-9b24-939f490fb040"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.azure_service_operator.azurerm_role_assignment.aso_contrib_role_assignment must be replaced
-/+ resource "azurerm_role_assignment" "aso_contrib_role_assignment" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg/providers/Microsoft.Authorization/roleAssignments/21d4b772-75b3-6024-bb85-c8fbdd9c9b5b" -> (known after apply)
      ~ name                                   = "21d4b772-75b3-6024-bb85-c8fbdd9c9b5b" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/f5791770-b0cf-8518-1d9b-94fc80e70ac5" -> (known after apply) # forces replacement
      ~ role_definition_name                   = "dis-identity-admin-corr-at22" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role will be destroyed
  # (because azurerm_role_definition.user_assigned_identity_role is not in configuration)
  - resource "azurerm_role_definition" "user_assigned_identity_role" {
      - assignable_scopes           = [
          - "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg",
        ] -> null
      - description                 = "Role for Dis deployed Azure Service Operator to manage resources in the specified resource group." -> null
      - id                          = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/f5791770-b0cf-8518-1d9b-94fc80e70ac5|/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg" -> null
      - name                        = "dis-identity-admin-corr-at22" -> null
      - role_definition_id          = "f5791770-b0cf-8518-1d9b-94fc80e70ac5" -> null
      - role_definition_resource_id = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/f5791770-b0cf-8518-1d9b-94fc80e70ac5" -> null
      - scope                       = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg" -> null

      - permissions {
          - actions          = [
              - "Microsoft.ManagedIdentity/userAssignedIdentities/read",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/write",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/delete",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/read",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/write",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/delete",
              - "Microsoft.ManagedIdentity/userAssignedIdentities/revokeTokens/action",
              - "Microsoft.DBforPostgreSQL/flexibleServers/read",
              - "Microsoft.DBforPostgreSQL/flexibleServers/write",
              - "Microsoft.DBforPostgreSQL/flexibleServers/delete",
              - "Microsoft.DBforPostgreSQL/flexibleServers/databases/read",
              - "Microsoft.DBforPostgreSQL/flexibleServers/databases/write",
              - "Microsoft.DBforPostgreSQL/flexibleServers/databases/delete",
              - "Microsoft.DBforPostgreSQL/flexibleServers/administrators/read",
              - "Microsoft.DBforPostgreSQL/flexibleServers/administrators/write",
              - "Microsoft.DBforPostgreSQL/flexibleServers/administrators/delete",
              - "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/read",
              - "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/write",
              - "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/delete",
              - "Microsoft.Network/privateDnsZones/read",
              - "Microsoft.Network/privateDnsZones/write",
              - "Microsoft.Network/privateDnsZones/delete",
              - "Microsoft.Network/privateDnsZones/virtualNetworkLinks/read",
              - "Microsoft.Network/privateDnsZones/virtualNetworkLinks/write",
              - "Microsoft.Network/privateDnsZones/virtualNetworkLinks/delete",
              - "Microsoft.Network/virtualNetworks/join/action",
              - "Microsoft.Insights/diagnosticSettings/read",
              - "Microsoft.Insights/diagnosticSettings/write",
              - "Microsoft.Insights/diagnosticSettings/delete",
              - "Microsoft.Authorization/*/read",
            ] -> null
          - data_actions     = [] -> null
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
        }
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role_dis_aks_vnet will be created
  + resource "azurerm_role_definition" "user_assigned_identity_role_dis_aks_vnet" {
      + assignable_scopes           = [
          + "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet",
        ]
      + description                 = "Role for Dis deployed Azure Service Operator to manage aks vnet."
      + id                          = (known after apply)
      + name                        = "dis-aso-vnet-join-corr-at22"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet"

      + permissions {
          + actions     = [
              + "Microsoft.Network/virtualNetworks/join/action",
              + "Microsoft.Authorization/*/read",
            ]
          + not_actions = []
        }
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role_dis_rg will be created
  + resource "azurerm_role_definition" "user_assigned_identity_role_dis_rg" {
      + assignable_scopes           = [
          + "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg",
        ]
      + description                 = "Role for Dis deployed Azure Service Operator to manage resources in the specified resource group."
      + id                          = (known after apply)
      + name                        = "dis-aso-rg-admin-corr-at22"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg"

      + permissions {
          + actions     = [
              + "Microsoft.ManagedIdentity/userAssignedIdentities/read",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/write",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/delete",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/read",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/write",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/delete",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/revokeTokens/action",
              + "Microsoft.DBforPostgreSQL/flexibleServers/read",
              + "Microsoft.DBforPostgreSQL/flexibleServers/write",
              + "Microsoft.DBforPostgreSQL/flexibleServers/delete",
              + "Microsoft.DBforPostgreSQL/flexibleServers/databases/read",
              + "Microsoft.DBforPostgreSQL/flexibleServers/databases/write",
              + "Microsoft.DBforPostgreSQL/flexibleServers/databases/delete",
              + "Microsoft.DBforPostgreSQL/flexibleServers/administrators/read",
              + "Microsoft.DBforPostgreSQL/flexibleServers/administrators/write",
              + "Microsoft.DBforPostgreSQL/flexibleServers/administrators/delete",
              + "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/read",
              + "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/write",
              + "Microsoft.DBforPostgreSQL/flexibleServers/virtualendpoints/delete",
              + "Microsoft.Network/privateDnsZones/read",
              + "Microsoft.Network/privateDnsZones/write",
              + "Microsoft.Network/privateDnsZones/delete",
              + "Microsoft.Network/privateDnsZones/virtualNetworkLinks/read",
              + "Microsoft.Network/privateDnsZones/virtualNetworkLinks/write",
              + "Microsoft.Network/privateDnsZones/virtualNetworkLinks/delete",
              + "Microsoft.Network/virtualNetworks/join/action",
              + "Microsoft.Insights/diagnosticSettings/read",
              + "Microsoft.Insights/diagnosticSettings/write",
              + "Microsoft.Insights/diagnosticSettings/delete",
              + "Microsoft.Authorization/*/read",
            ]
          + not_actions = []
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |